#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bombola/gh-actions/runs/run-u6HKbuB8zHa39m7m

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kill_switch.google_cloudfunctions_function.kill_switch_func will be created
  + resource "google_cloudfunctions_function" "kill_switch_func" {
      + available_memory_mb           = 128
      + description                   = "Function used to disconnect billing account from project"
      + entry_point                   = "stopBilling"
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 0
      + name                          = "kill_switch"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "nodejs14"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = "kill_switch_bucket_main"
      + source_archive_object         = "function.zip"
      + timeout                       = 20
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "providers/cloud.pubsub/eventTypes/topic.publish"
          + resource   = "kill_switch_topic"

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # module.kill_switch.google_pubsub_topic.kill_switch_topic will be created
  + resource "google_pubsub_topic" "kill_switch_topic" {
      + id      = (known after apply)
      + name    = "kill_switch_topic"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.kill_switch.google_storage_bucket.kill_switch_bucket will be created
  + resource "google_storage_bucket" "kill_switch_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-CENTRAL2"
      + name                        = "kill_switch_bucket_main"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.kill_switch.google_storage_bucket_object.archive will be created
  + resource "google_storage_bucket_object" "archive" {
      + bucket         = "kill_switch_bucket_main"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "function.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "kill_switch/function.zip"
      + storage_class  = (known after apply)
    }

  # module.k8s_cluster.module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west2-a"
      + logging_service             = "none"
      + master_version              = (known after apply)
      + min_master_version          = "1.22.8-gke.200"
      + monitoring_service          = "none"
      + name                        = "gke-cluster"
      + network                     = "projects/main-348108/global/networks/default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "main-348108"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/main-348108/regions/europe-west2/subnetworks/default"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = false
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = true
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = false

          + auto_provisioning_defaults {
              + image_type      = (known after apply)
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + state = "DECRYPTED"
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + monitoring_config {
          + enable_components = (known after apply)
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = 0
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = "default-pool"
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = "COS"
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = "e2-micro"
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = (known after apply)
              + tags              = [
                  + "gke-gke-cluster",
                  + "gke-gke-cluster-default-pool",
                ]
              + taint             = (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + workload_pool = "main-348108.svc.id.goog"
        }
    }

  # module.k8s_cluster.module.gke.google_container_node_pool.pools["default-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "gke-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 2
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west2-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "default-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "main-348108"
      + version                     = "1.22.8-gke.200"

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 0
        }

      + management {
          + auto_repair  = false
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name" = "gke-cluster"
              + "node_pool"    = "default-node-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-micro"
          + metadata          = {
              + "cluster_name"             = "gke-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "default-node-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + tags              = [
              + "gke-gke-cluster",
              + "gke-gke-cluster-default-node-pool",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.k8s_cluster.module.gke.google_project_iam_member.cluster_service_account-artifact-registry["main-348108"] will be created
  + resource "google_project_iam_member" "cluster_service_account-artifact-registry" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "main-348108"
      + role    = "roles/artifactregistry.reader"
    }

  # module.k8s_cluster.module.gke.google_project_iam_member.cluster_service_account-gcr["main-348108"] will be created
  + resource "google_project_iam_member" "cluster_service_account-gcr" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "main-348108"
      + role    = "roles/storage.objectViewer"
    }

  # module.k8s_cluster.module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "main-348108"
      + role    = "roles/logging.logWriter"
    }

  # module.k8s_cluster.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "main-348108"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.k8s_cluster.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "main-348108"
      + role    = "roles/monitoring.viewer"
    }

  # module.k8s_cluster.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "main-348108"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.k8s_cluster.module.gke.google_service_account.cluster_service_account[0] will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + disabled     = false
      + display_name = "Terraform-managed service account for cluster gke-cluster"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "main-348108"
      + unique_id    = (known after apply)
    }

  # module.k8s_cluster.module.gke.random_shuffle.available_zones will be created
  + resource "random_shuffle" "available_zones" {
      + id           = (known after apply)
      + input        = [
          + "europe-west2-a",
          + "europe-west2-b",
          + "europe-west2-c",
        ]
      + result       = (known after apply)
      + result_count = 3
    }

  # module.k8s_cluster.module.gke.random_string.cluster_service_account_suffix will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.k8s_cluster.module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "2"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @Paszymaja, Action: `pull_request`*